In [1]:
import pandas as pd
import numpy as np

In [2]:
from functions import read_data, clean_data, change_value, change_name_country_education, change_name_country_unemployment, drop_columns_education, drop_columns_unemployment, change_name_country_education, change_name_country_unemployment, column_names_education, column_names_unemployment, nulos

In [3]:
url = "data/edat_lfs_9903__custom_12827842_linear.csv"
education = read_data(url)
pd.set_option('display.max_columns', None)

In [4]:
education = clean_data(education)
drop_columns_education(education)
column_names_education(education)

,sex,level_education,age,country,year,value_education
0,F:Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,AT:Austria,2014,27.9
1,F:Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,AT:Austria,2015,27.5
2,F:Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,AT:Austria,2016,27.3
3,F:Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,AT:Austria,2017,27.2
4,F:Females,"ED0-2:Less than primary, primary and lower sec...",Y15-29:From 15 to 29 years,AT:Austria,2018,27.1
...,...,...,...,...,...,...
6529,T:Total,ED5-8:Tertiary education (levels 5-8),Y15-29:From 15 to 29 years,UK:United Kingdom,2015,28.9
6530,T:Total,ED5-8:Tertiary education (levels 5-8),Y15-29:From 15 to 29 years,UK:United Kingdom,2016,29.3
6531,T:Total,ED5-8:Tertiary education (levels 5-8),Y15-29:From 15 to 29 years,UK:United Kingdom,2017,29.5
6532,T:Total,ED5-8:Tertiary education (levels 5-8),Y15-29:From 15 to 29 years,UK:United Kingdom,2018,30.4
6533,T:Total,ED5-8:Tertiary education (levels 5-8),Y15-29:From 15 to 29 years,UK:United Kingdom,2019,31.1

In [5]:
education = change_value(education)  #cambia los valores de sex
education = change_name_country_education(education)  #cambia los valores de geo
education = nulos(education)
education.head()

       sex level_education    age  country  year  value_education
0  Females             ESO  15-29  Austria  2014             27.9
1  Females             ESO  15-29  Austria  2015             27.5
2  Females             ESO  15-29  Austria  2016             27.3
3  Females             ESO  15-29  Austria  2017             27.2
4  Females             ESO  15-29  Austria  2018             27.1

In [6]:
education = education[education["country"] != "Bosnia and Herzegovina"]

In [7]:
url2 = "data/yth_empl_090__custom_12832588_linear.csv"
unemployment = read_data(url2)

In [8]:
unemployment = clean_data(unemployment)
drop_columns_unemployment(unemployment)
column_names_unemployment(unemployment)
unemployment

      sex     age level_education country  year  value_unemployment
0       F  Y15-29           ED0-2      AT  2014                15.7
1       F  Y15-29           ED0-2      AT  2015                15.3
2       F  Y15-29           ED0-2      AT  2016                17.1
3       F  Y15-29           ED0-2      AT  2017                16.8
4       F  Y15-29           ED0-2      AT  2018                13.4
...    ..     ...             ...     ...   ...                 ...
13729   T  Y15-29           TOTAL      UK  2015               882.1
13730   T  Y15-29           TOTAL      UK  2016               769.5
13731   T  Y15-29           TOTAL      UK  2017               688.1
13732   T  Y15-29           TOTAL      UK  2018               649.3
13733   T  Y15-29           TOTAL      UK  2019               609.3

[13734 rows x 6 columns]

In [9]:
unemployment = change_value(unemployment)
unemployment = change_name_country_unemployment(unemployment)
unemployment = nulos(unemployment)
unemployment.head()

       sex    age level_education  country  year  value_unemployment
0  Females  15-29             ESO  Austria  2014                15.7
1  Females  15-29             ESO  Austria  2015                15.3
2  Females  15-29             ESO  Austria  2016                17.1
3  Females  15-29             ESO  Austria  2017                16.8
4  Females  15-29             ESO  Austria  2018                13.4

In [10]:
education = education[education["country"] != "Luxembourg"]

In [11]:
unemployment = unemployment[unemployment["country"] != "Luxembourg"]

In [12]:
unemployment = unemployment[unemployment["country"] != "Montenegro"]
education = education[education["country"] != "Montenegro"]

unemployment = unemployment[unemployment["country"] != "Malta"]
education = education[education["country"] != "Malta"]

In [13]:
unemployment = unemployment[unemployment["level_education"] != "TOTAL"]

In [14]:
unemployment["level_education"].unique()

array(['ESO', 'BACH-FP', 'BACH', 'FP', 'UNIVERSIDAD'], dtype=object)

In [15]:
unemployment.duplicated(subset=["sex", "level_education", "age", "country", "year"]).sum()

4416

In [16]:
unemployment = unemployment.drop_duplicates(subset=["sex", "level_education", "age", "country", "year"])
unemployment

,sex,age,level_education,country,year,value_unemployment
0,Females,15-29,ESO,Austria,2014,15.7
1,Females,15-29,ESO,Austria,2015,15.3
2,Females,15-29,ESO,Austria,2016,17.1
3,Females,15-29,ESO,Austria,2017,16.8
4,Females,15-29,ESO,Austria,2018,13.4
...,...,...,...,...,...,...
10931,Total,15-29,UNIVERSIDAD,United Kingdom,2015,5.4
10932,Total,15-29,UNIVERSIDAD,United Kingdom,2016,5.0
10933,Total,15-29,UNIVERSIDAD,United Kingdom,2017,4.6
10934,Total,15-29,UNIVERSIDAD,United Kingdom,2018,4.4
10935,Total,15-29,UNIVERSIDAD,United Kingdom,2019,4.8

In [17]:
nuevo2 = pd.merge(unemployment, education, on = ["sex", "level_education", "age", "country", "year"], how = "right")
nuevo2

,sex,age,level_education,country,year,value_unemployment,value_education
0,Females,15-29,ESO,Austria,2014,15.7,27.9
1,Females,15-29,ESO,Austria,2015,15.3,27.5
2,Females,15-29,ESO,Austria,2016,17.1,27.3
3,Females,15-29,ESO,Austria,2017,16.8,27.2
4,Females,15-29,ESO,Austria,2018,13.4,27.1
...,...,...,...,...,...,...,...
4666,Total,15-29,UNIVERSIDAD,United Kingdom,2015,5.4,28.9
4667,Total,15-29,UNIVERSIDAD,United Kingdom,2016,5.0,29.3
4668,Total,15-29,UNIVERSIDAD,United Kingdom,2017,4.6,29.5
4669,Total,15-29,UNIVERSIDAD,United Kingdom,2018,4.4,30.4
4670,Total,15-29,UNIVERSIDAD,United Kingdom,2019,4.8,31.1

In [18]:
nuevo2.isnull().sum()

sex                     0
age                     0
level_education         0
country                 0
year                    0
value_unemployment    255
value_education         0
dtype: int64

In [19]:
nuevo2[nuevo2.isnull().any(axis = 1) == True].country.unique()

array(['Cyprus', 'Estonia', 'Croatia', 'Ireland', 'Lithuania', 'Latvia',
       'Poland', 'Slovenia', 'Slovakia', 'Iceland', 'Norway', 'Bulgaria',
       'Denmark', 'Finland', 'Hungary', 'Romania'], dtype=object)

In [20]:
nuevo2[(nuevo2["country"] == "Norway") & (pd.isna(nuevo2["value_unemployment"]))]

,sex,age,level_education,country,year,value_unemployment,value_education
538,Females,15-29,BACH-FP,Norway,2022,NaN,27.3
849,Females,15-29,BACH,Norway,2022,NaN,19.2
1151,Females,15-29,FP,Norway,2017,NaN,7.6
1152,Females,15-29,FP,Norway,2018,NaN,8.1
1153,Females,15-29,FP,Norway,2019,NaN,8.3
1154,Females,15-29,FP,Norway,2020,NaN,7.5
1155,Females,15-29,FP,Norway,2021,NaN,8.8
1156,Females,15-29,FP,Norway,2022,NaN,8.1
1157,Females,15-29,FP,Norway,2023,NaN,6.4
1464,Females,15-29,UNIVERSIDAD,Norway,2017,NaN,27.7
1465,Females,15-29,UNIVERSIDAD,Norway,2018,NaN,29.0
1466,Females,15-29,UNIVERSIDAD,Norway,2019,NaN,29.2
1469,Females,15-29,UNIVERSIDAD,Norway,2022,NaN,32.9
1470,Females,15-29,UNIVERSIDAD,Norway,2023,NaN,34.0
2407,Males,15-29,BACH,Norway,2023,NaN,17.5
2708,Males,15-29,FP,Norway,2017,NaN,14.3
2709,Males,15-29,FP,Norway,2018,NaN,16.1
2710,Males,15-29,FP,Norway,2019,NaN,16.7
2711,Males,15-29,FP,Norway,2020,NaN,17.3
2712,Males,15-29,FP,Norway,2021,NaN,17.3
2713,Males,15-29,FP,Norway,2022,NaN,15.5
2714,Males,15-29,FP,Norway,2023,NaN,15.6
3021,Males,15-29,UNIVERSIDAD,Norway,2017,NaN,19.3
3022,Males,15-29,UNIVERSIDAD,Norway,2018,NaN,18.9
3023,Males,15-29,UNIVERSIDAD,Norway,2019,NaN,18.4
3026,Males,15-29,UNIVERSIDAD,Norway,2022,NaN,21.8
3027,Males,15-29,UNIVERSIDAD,Norway,2023,NaN,22.2
4265,Total,15-29,FP,Norway,2017,NaN,11.0
4266,Total,15-29,FP,Norway,2018,NaN,12.2
4267,Total,15-29,FP,Norway,2019,NaN,12.7
4269,Total,15-29,FP,Norway,2021,NaN,13.2
4270,Total,15-29,FP,Norway,2022,NaN,11.9
4271,Total,15-29,FP,Norway,2023,NaN,11.1